export default {
  ClientType: {
    WEBUI: 4
  },
  UserType: {
    GUEST: -1,		// 游客
    REAL: 0,		// 真实
    DEMO: 1		// 模拟
  },

  StockType: {
    Direct: 0,				// 直接货币
    InDirect: 1,			// 间接货币
    CrossDirect: 2,		// 交叉直接货币
    CrossInDirect: 3,		// 交叉间接货币
    HkDirect: 71 //港股货币
  },

  /**
     * 强制踢出原因
     */
  UserForceLogout: {
    ALREADY_LOGIN: 0,		// 已經登入
    USER_DISABLE: 1,		// 用户被停用
    ACCOUNT_DISABLE: 2,	// 账户被禁用
    PWD_CHANGE: 3,			// 修改密码
    RECONNECT: 4			// 连接被重置
  },
  /**
     * 买卖方向
     */
  OrderDirection: {
    BUY: 1, // 买
    SELL: 2		// 卖
  },
  /**
     * 订单类型
     */
  OrderType: {
    OPEN: 1,		// 市价建仓0x01
    LIMIT: 2,		// 限价建仓0x02
    STOP: 4,		// 停损建仓0x04
    CLOSE: 8 		// 市价平仓0x08
  },
  /**
     * 过期类型
     */
  ExpireType: {
    DAY: 1,			// 当日有效
    WEEK: 2,		// 当周有效
    SPECIFIE: 3		// 指定日期
  },
  /**
     * 持仓状态
     */
  PositionStatus: {
    OPENED: 1,			// 开仓
    CLOSED: 2,			// 平仓
    CLOSING: 3,		// mt4 used when GTS2 waiting for MT4 to confirm position closed
    DEALING: 4,		// position is pending to deal by dealer on admin
    DELETED: 5,
    EOD: 6,			// 日结
    OPENING: 7,		// mt4 used when GTS2 waiting for MT4 to confirm position opened
    MAX: 8
  },
  /**
     * 订单状态
     */
  OrderStatus: {
    PLACED: 1,			// 等待
    FILLED: 2,			// 已执行
    PARTIAL_FILLED: 3,	// (不支持)
    CANCELED: 4,		// 已取消
    REJECTED: 5,
    DELETED: 6
  },
  /**
     * 成交原因
     */
  DealReason: {
    OPEN: 1,			// 市价建仓0x08
    LIMIT: 2,			// 限价建仓0x02
    STOP: 4,			// 停损建仓0x04
    CLOSE: 8,			// 市价平仓0x08
    STOP_LOSS: 16,		// 止损	0x10
    TAKE_PROFIT: 32,	// 止盈	0x20
    STOP_OUT: 64,		// 强制平仓0x40
    PARTIAL_CLOSE: 128, // 部分平仓0x80
    EXPIRED: 0xA0, 	// 到期0xA0
    GROUP_CLOSE: 0xA1	// 组平仓0xA0
  },
  /**
     * 交易品种可用状态 可用状态：0-未激活；1-可用；2-不可用；3-到期；
     */
  SymbolEnable: {
    INACTIVATED: 0,	// 未激活
    ENABLED: 1,		// 可用
    DISABLED: 2,		// 不可用
    EXPIRED: 3			// 到期
  },
  /**
     * 交易品种交易状态 交易状态：0-不可交易；1-可交易；2-参考行情（不可交易）；3-仅平仓；
     */
  SymbolTradable: {
    DISABLED: 0,		// 不可交易
    TRADABLE: 1,		// 可交易
    REFERENCE: 2,		// 参考行情（不可交易）---目前admin设置的不可交易..
    CLOSEONLY: 3		// 仅平仓
  },
  /**
     * 产品分类--UI自定义区分显示
     */
  SymboCategory: {
    FX: 0,			// 外汇
    METAL: 1,		// 贵金属
    OIL: 2,		// 期货-期油
    INDEX: 3,		// 期货-期指
    REF: 4			// 参考行情
  },
  /**
     * 交易产品类型
     */
  SymboType: {
    FX: 0,			// 外汇
    METAL: 1,		// 贵金属
    CFD: 2			// 到期CFD（期货）
  },
  /**
     * 行情产品类型
     */
  ZoneType: {
    REF: 3,		// 参考行情
    FX: 2,			// 外汇
    METAL: 1,		// 贵金属
    OIL: 4,		// 期油
    INDEX: 5		// 期指
  },
  Lang: {
    zh_CN: 'zh_CN',
    zh_TW: 'zh_TW',
    en_US: 'en_US'
  },
  /**
     * 币种-显示单位
     */
  Currency: {
    USD: '$',
    CNY: '¥'
  },
  FundsMask: '****',

  Req: {
    quoteQuery: '0x10301',		// 历史行情报价
    quoteMin: '0x10305', // 分时图数据
    lastTick: '0x10303',		// 最后一口报价
    subsTick: '0x10304',		// 行情订阅

    logoutServer: '0x1315',	// 登出交易服务器
    serverTime: '0x100D',		// 交易服务器系统时间
    serverGet: '0x1004',		// 交易服务器信息
    tradeTimes: '0x120C',		// 交易时间列表
    holidays: '0x1C05',		// 假期数据
    marginLevels: '0x1224',	// 层级保证金列表

    symbols: '0x1208',			// 交易品种列表（产品列表）
    pendings: '0x1705',		// 挂单记录
    deals: '0x1807',			// 当日成交记录
    positions: '0x1905',		// 持仓记录
    openOrder: '0x1701',		// 开仓（市价、挂单）、平仓(市价)
    modifyOrder: '0x1702',		// 改单（挂单）
    cancelOrder: '0x1709',		// 撤单
    profitloss: '0x1902'		// 设置止损止盈
  },

  WebUIError: {
    // server side
    '-1': '参数无效',
    1: '密码错误',
    2: '请输入正确验证码',
    3: '请输入正确验证码',
    4: '无操作权限',
    5: '操作失败',
    6: '操作失败',
    7: '操作失败',
    8: '操作失败',
    9: '操作失败',
    10: '操作失败',

    11: '操作失败',
    12: '用户已存在',
    13: '请输入正确用户账号',
    14: '对不起，账户已在其他设备登入！',
    15: '模拟账号过期，请开立真实账户',
    16: '请输入正确用户账号',
    17: '用户已存在',
    18: '对不起，该账号已登录',
    19: '服务器无响应，请稍候再试',
    20: '服务器无响应，请稍候再试',

    21: '服务器无响应，请稍候再试',
    22: '服务器无响应，请稍候再试',
    23: '服务器无响应，请稍候再试',
    24: '暂无相关记录',
    25: '操作失败',
    26: '操作失败',
    27: '操作失败',
    28: '操作失败',
    29: '操作失败',
    30: '操作失败',

    31: '操作失败',
    32: '操作失败',
    33: '操作失败',
    34: '操作失败',
    35: '操作失败',
    36: '操作失败',
    37: '操作失败',
    38: '系统忙，请稍候再试',
    39: '保证金不足，为保证不影响您的交易，请及时补充资金',
    40: '操作失败',

    41: '操作失败',
    42: '暂无相关记录',
    43: '操作失败',
    44: '操作失败',
    45: '操作失败',
    46: '操作失败',
    47: '操作失败',
    48: '操作失败',
    49: '操作失败',
    50: '参考行情，不提供交易服务',

    51: '操作失败',
    52: '操作失败',
    53: '操作失败',
    54: '系统正在处理，请稍候',
    55: '订单已成交',
    56: '订单状态错误',
    57: '操作失败',
    58: '操作失败',
    59: '交易成功',
    60: '服务器无响应，请稍候再试',

    61: '操作失败',
    62: '价格已变动，请重新下单',
    63: '价格已变动，请重新下单',
    64: '已超出单笔交易的有效下单手数',
    65: '低于单笔交易的有效下单手数',
    66: '操作失败',
    67: '平仓手数已超出持仓手数',
    68: '操作失败',
    69: '操作失败',
    70: '无可平持仓',

    71: '无可平持仓',
    72: '操作失败', // 持仓已关闭
    73: '最大价格偏移点数范围（{0}-{1}）',
    74: '对不起，已超出最大持仓手数（{0}手）',
    75: '非交易时段，操作无效',
    76: '操作失败',
    77: '操作失败',
    78: '服务器无响应，请稍候再试',
    79: '服务器无响应，请稍候再试',
    80: '服务器无响应，请稍候再试',

    81: '操作失败',
    82: '操作失败',
    83: '最大下单笔数{0}笔',
    84: '非交易时段，操作无效',
    85: '非交易时段，操作无效',
    86: '非交易时段，操作无效',
    87: '该账号异常，请联系相关客服人员',
    88: '服务器无响应，请稍候再试',
    89: '请输入有效手数。有效手数为{0}的整倍数',
    90: '操作失败',

    91: '操作失败',
    92: '操作失败',
    93: '服务器无响应，请稍候再试', // 行情的報價超時或者沒有收到行情報價
    94: '当前产品已暂停交易',
    95: '当前产品已暂停交易',
    96: '当前账户只可进行平仓操作，若有疑问，请联系相关客服人员',
    97: '当前产品已暂停交易',
    98: '该账号异常，请联系相关客服人员',
    99: '当前账户只可进行平仓操作，若有疑问，请联系相关客服人员',
    100: '操作失败',
    102: '价格已变动，请重新下单',
    103: '超出持仓上限',
    104: '产品已过期',
    105: '产品已过期',
    107: '止损止盈设置错误',
    108: '当前产品只可进行平仓操作，若有疑问，请联系相关客服人员',	// RET_CLOSEONLY_GROUP_SYMBOL
    109: '当前产品只可进行平仓操作，若有疑问，请联系相关客服人员',	// RET_CLOSEONLY_GLOBAL_SYMBOL
    110: '服务器繁忙，请稍候再试',
    111: '服务器繁忙，请稍候再试',
    112: '无权限'
  }
}
